flask_api_entrega3/Entrega3/resultados_benchmark.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient).....done


Server Software:        Werkzeug/3.1.3
Server Hostname:        localhost
Server Port:            5000
SSL/TLS Protocol:       TLSv1.3,TLS_AES_256_GCM_SHA384,2048,256
Server Temp Key:        X25519 253 bits
TLS Server Name:        localhost

Document Path:          /api/segura-total
Document Length:        0 bytes

Concurrency Level:      10
Time taken for tests:   2.174 seconds
Complete requests:      100
Failed requests:        100
   (Connect: 0, Receive: 0, Length: 100, Exceptions: 0)
Keep-Alive requests:    0
Total transferred:      19900 bytes
HTML transferred:       3400 bytes
Requests per second:    45.99 [#/sec] (mean)
Time per request:       217.424 [ms] (mean)
Time per request:       21.742 [ms] (mean, across all concurrent requests)
Transfer rate:          8.94 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        8  165  47.9    172     262
Processing:    19   43  12.0     43     107
Waiting:       19   41  11.8     41     107
Total:         48  209  51.5    220     308

Percentage of the requests served within a certain time (ms)
  50%    220
  66%    227
  75%    230
  80%    235
  90%    264
  95%    288
  98%    301
  99%    308
 100%    308 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)...This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)...This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)...This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)...